package andpact.project.wid.util

import java.time.LocalDate

/**
 * map -> 불변
 * hashMap -> 가변
 *
 * 레벨 당 경험치 총량(레벨 업을 위해 필요한 경험치)
 * 1 레벨에 경험치 10을 모았다 -> 레벨 업
 * 초 단위
 *
 * 최고 레벨, 증가 비율 생각해 보자.!!!!!!!!
 *
 * 동시에 2레벨 업 안되도록!!
 */
val levelRequiredExpMap: Map<Int, Int> = mapOf(
    1 to 86_400,
    2 to 172_800,
    3 to 259_200,
    4 to 345_600,
    5 to 432_000,
    6 to 518_400,
    7 to 604_800,
    8 to 691_200,
    9 to 777_600,
    10 to 864_000,
    11 to 950_400,   // 86,400 + 10 * 86,400
    12 to 1_036_800, // 86,400 + 11 * 86,400
    13 to 1_123_200, // 86,400 + 12 * 86,400
    14 to 1_209_600, // 86,400 + 13 * 86,400
    15 to 1_296_000, // 86,400 + 14 * 86,400
    16 to 1_382_400, // 86,400 + 15 * 86,400
    17 to 1_468_800, // 86,400 + 16 * 86,400
    18 to 1_555_200, // 86,400 + 17 * 86,400
    19 to 1_641_600, // 86,400 + 18 * 86,400
    20 to 1_728_000, // 86,400 + 19 * 86,400
    21 to 1_814_400, // 86,400 + 20 * 86,400
    22 to 1_900_800, // 86,400 + 21 * 86,400
    23 to 1_987_200, // 86,400 + 22 * 86,400
    24 to 2_073_600, // 86,400 + 23 * 86,400
    25 to 2_160_000, // 86,400 + 24 * 86,400
    26 to 2_246_400, // 86,400 + 25 * 86,400
    27 to 2_332_800, // 86,400 + 26 * 86,400
    28 to 2_419_200, // 86,400 + 27 * 86,400
    29 to 2_505_600, // 86,400 + 28 * 86,400
    30 to 2_592_000  // 86,400 + 29 * 86,400
)

//val levelToTotalExpMap: Map<Int, Int> = mapOf(
//    1 to 86_400,
//    2 to 259_200,    // 86,400 + 172,800
//    3 to 518_400,    // 86,400 + 172,800 + 259,200
//    4 to 864_000,    // 86,400 + 172,800 + 259,200 + 345,600
//    5 to 1_296_000,  // 86,400 + 172,800 + 259,200 + 345,600 + 432,000
//    6 to 1_818_400,  // 86,400 + 172,800 + 259,200 + 345,600 + 432,000 + 518,400
//    7 to 2_433_600,  // 86,400 + 172,800 + 259,200 + 345,600 + 432,000 + 518,400 + 604,800
//    8 to 3_144_800,  // 86,400 + 172,800 + 259,200 + 345,600 + 432,000 + 518,400 + 604,800 + 691,200
//    9 to 3_955_200,  // 86,400 + 172,800 + 259,200 + 345,600 + 432,000 + 518,400 + 604,800 + 691,200 + 777,600
//    10 to 4_864_000, // 86,400 + 172,800 + 259,200 + 345,600 + 432,000 + 518,400 + 604,800 + 691,200 + 777,600 + 864,000
//    11 to 5_870_400, // 누적합 + 950,400
//    12 to 6_973_200, // 누적합 + 1,036,800
//    13 to 8_171_600, // 누적합 + 1,123,200
//    14 to 9_465_600, // 누적합 + 1,209,600
//    15 to 10_855_600, // 누적합 + 1,296,000
//    16 to 12_341_600, // 누적합 + 1,382,400
//    17 to 13_923_600, // 누적합 + 1,468,800
//    18 to 15_601_600, // 누적합 + 1,555,200
//    19 to 17_375_600, // 누적합 + 1,641,600
//    20 to 19_245_600, // 누적합 + 1,728,000
//    21 to 21_211_600, // 누적합 + 1,814,400
//    22 to 23_273_600, // 누적합 + 1,900,800
//    23 to 25_441_600, // 누적합 + 1,987,200
//    24 to 27_715_600, // 누적합 + 2,073,600
//    25 to 30_095_600, // 누적합 + 2,160,000
//    26 to 32_581_600, // 누적합 + 2,246,400
//    27 to 35_173_600, // 누적합 + 2,332,800
//    28 to 37_871_600, // 누적합 + 2,419,200
//    29 to 40_675_600, // 누적합 + 2,505,600
//    30 to 43_585_600  // 누적합 + 2,592,000
//)

/**
 * 레벨 업이 진행되면 밸류에 날짜에 해당하는 값을 넣자.
 * 계정을 생성했을 때, 클라이언트에서 사용할 map<Int, LocalDate>와
 * 서버에 저장할 map<String, String> 둘 다 필요하다.
 *
 * 기존 계정의 경우 서버에서 map<Int, String>을 가져와서 map<Int, LocalDate>로 변경 후 사용하면 된다.
 */
val defaultLevelDateMap: Map<String, LocalDate> = mapOf(
    "1" to LocalDate.now()
)

/** 클라이언트 : Map<String, LocalDate> -> 서버 : Map<String, String> */
fun convertLevelToDateMapForServer(map: Map<String, LocalDate>): Map<String, String> {
//    Log.d("DataUtil", "convertLevelToDateMapForServer executed")

    return map.mapValues { it.value.toString() }
}

/** 서버 : Map<String, String> -> 클라이언트 : Map<String, LocalDate> */
fun convertLevelToDateMapForClient(map: Map<String, String>): Map<String, LocalDate> {
//    Log.d("DataUtil", "convertLevelToDateMapForClient executed")

    return map.mapValues { LocalDate.parse(it.value) }
}